"Automatically Install" = "Автоматично инсталиране";

"Delete After Install" = "Изтрии след инсталиране";

"Remove Metadata"="Премахни метаданните";

"Keep Awake"="Дръж у-вото будно";

"Enable iTunes Sync to make apps installed by AppCake can be transfered to your computer by iTunes."="Включете iTunes Sync за да можете да прехвърляте инсталираните приложения на компютъра си чрез iTunes.";

"iTunes Sync"="iTunes Sync";

"Feedback"="Обратна връзка";

"Changelog"="История на промените";

"I Can Translate"="Мога да превеждам";

"Clear Image Cache"="Изчисти кеш паметта";

